tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
cask "emacs"
# svn is required for installing the source code pro fonts
brew "svn"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"
cask "iterm2"
cask "docker"
cask "postman"
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "bash"
brew "gpatch"
brew "less"
brew "m4"
brew "make"
brew "nano"
brew "bison"
brew "flex"
brew "libressl"
brew "file-formula"
brew "git"
brew "bash-git-prompt"
# Prefer the Apple ssh as it has keychain support
# brew "openssh"
brew "perl"
brew "python"
brew "rsync"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "curl"
brew "wdiff"
brew "gdb"
brew "autoconf"
brew "pstree"
brew "tmux"
brew "aspell"
brew "htop"
brew "netcat"
brew "bash-completion"
# Don't install these if we're using the docker cask as conflicts arise.
# brew "docker-completion"
# brew "docker-compose-completion"
# brew "docker-machine-completion"
brew "ImageMagick"
#brew "hg"
#brew "ag"
#brew "ykpers"
#brew "ykman"
brew "nvm"
brew "yarn"
brew "postgresql@14"
brew "stow"
brew "virtualenvwrapper"
brew "poetry"
brew "pyenv"
cask "cameracontroller"
brew "starship"
